OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/multiphase/interFoam/RAS/mixerVesselAMI/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    vessel
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    oilInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    shaftRotating
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    shaft
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    sparger
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    stirrer
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    baffles
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    AMI1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    AMI2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
